# Pandas

open-source Pyhton Library

we can accomplish 5 typical steps, regardless of origin of data: load, prepare, manipulate, model, and analyze

The 2 data strucutres:

* Series

* DataFrame

In [1]:
import numpy as np
import pandas as pd

# Getting to know Pandas' Data Structures
## Understanding Series Objects

In [2]:
revenues = pd.Series([5555, 7000, 1999])  # using list [5555, 7000, 1999] to create Series object called revenues

A Series object wraps 2 components:
* sequence of values   -> accessed by `.values`

* sequence of identifiers (index)  -> accessed by `.index`

In [67]:
revenues.values

array([5555, 7000, 1999], dtype=int64)

In [68]:
revenues.index

RangeIndex(start=0, stop=3, step=1)

Pandas Series also has integer index that's implicitly defined. It indicates the element's position in the Series.

However, Series can also have an arbitrary type of index (or labels)

In [9]:
city_revenues = pd.Series(
    [4200, 8000, 6500],
    index=["Amsterdam", "Toronto", "Tokyo"]
)
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

Here, the index is a list of city names represented by strings.

Two types of Series:
* revenues: behaves like Python list cz only has a positional index

* city_revenues: like a Python dictionary cz it features both positional and label index

In [3]:
# construct a Series with a label index from a Python dictionary:
city_employee_count = pd.Series({"Amsterdam": 5, "Tokyo": 8})    # dict keys become index, dict values become Series values
city_employee_count

Amsterdam    5
Tokyo        8
dtype: int64

Like Dict, Series also support ```.keys()``` and the ``in`` keyword:

In [5]:
city_employee_count.keys()

Index(['Amsterdam', 'Tokyo'], dtype='object')

In [6]:
"Tokyo" in city_employee_count

True

In [7]:
"New York" in city_employee_count

False

## Understanding DataFrame Objects

In [10]:
city_data = pd.DataFrame({
    "revenue": city_revenues,
    "employee_count": city_employee_count
}) # creating a DataFrame from previously created Series objects, city_revenues and city_employee_count

In [12]:
city_data         #note how Pandas replaced missing employee_count value for Toronto with NaN

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

The new DataFrame index is the union of the 2 Series indices:

In [13]:
city_data.index

Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object')

The dimenions in DataFrame can be referred as axes:

In [14]:
city_data.axes

[Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object'),
 Index(['revenue', 'employee_count'], dtype='object')]

In [15]:
city_data.axes[0] # this is the row index

Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object')

In [16]:
city_data.axes[1] # this is the column index

Index(['revenue', 'employee_count'], dtype='object')

The axis marked with 0 is the row index, and the axis marked with 1 is the column index. This terminology is important to know because you’ll encounter several DataFrame methods that accept an axis parameter.

A DataFrame is also a dictionary-like data structure, so it also supports ```.keys()``` and the ``in`` keyword. However, for a DataFrame these don’t relate to the index, but to the columns:

In [17]:
city_data.keys()

Index(['revenue', 'employee_count'], dtype='object')

In [18]:
"Amsterdam" in city_data

False

In [19]:
"revenue" in city_data

True

## Accessing Series Elements

Indexing operator `([])` can be used for Series.

Pandas-specific access methods:
* `.loc`
* `.iloc`

Using indexing operator:

In [20]:
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [21]:
city_revenues["Toronto"]

8000

In [22]:
city_revenues[1]

8000

Using `.loc` and `.iloc`:

In [23]:
colors = pd.Series(
    ["red", "purple", "blue", "green", "yellow"],
    index=[1, 2, 3, 5, 8]
)
colors

1       red
2    purple
3      blue
5     green
8    yellow
dtype: object

`colors[1]` will give "purple". 

But, it's different with `.loc` and `.iloc` :
* `.loc` refers to the label index
* `.iloc` refers to the positional index

In [24]:
colors.loc[1]

'red'

In [25]:
colors.iloc[1]

'purple'

when slicing:
* `.loc` includes the closing element
* `.iloc` excludes the closing element

In [28]:
colors.loc[1:3]

1       red
2    purple
3      blue
dtype: object

In [27]:
colors.iloc[1:3]

2    purple
3      blue
dtype: object

To distinguish between two Series behaviors:
* You can use `.iloc` on a Series similar to using `[]` on a **list**.
* You can use `.loc` on a Series similar to using `[]` on a **dictionary**.

## Accessing DataFrame Elements

#### Hands on

In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.Series([2,3,6])

0    2
1    3
2    6
dtype: int64

In [3]:
pd.Series(['a', 'b', 'c'])

0    a
1    b
2    c
dtype: object

In [5]:
pd.Series([1, 'a', 4.7])

0      1
1      a
2    4.7
dtype: object

In [9]:
pd.Series([2, 7, 5], index=['val1', 'val2', 'val3'])

val1    2
val2    7
val3    5
dtype: int64

In [10]:
city_em = pd.Series({'Armsterdam':5, 'Tokyo':9})
city_em

Armsterdam    5
Tokyo         9
dtype: int64

In [11]:
city_em.keys()

Index(['Armsterdam', 'Tokyo'], dtype='object')

In [12]:
'Tokyo' in city_em

True

In [13]:
9 in city_em

False

#### DataFrame

`pd.DataFrame({})`

In [14]:
pd.DataFrame({'col1': [4,6,2],
                'col2': [3,2,5]})

   col1  col2
0     4     3
1     6     2
2     2     5

In [20]:
city_employee_count = pd.Series({"Amsterdam": 5, "Tokyo": 8})
city_employee_count

Amsterdam    5
Tokyo        8
dtype: int64

In [21]:
city_revenues = pd.Series(
    [4200, 8000, 6500],
    index=["Amsterdam", "Toronto", "Tokyo"]
)
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [23]:
city_data = pd.DataFrame({
    "revenue": city_revenues,
    "employee_count": city_employee_count
})

city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [24]:
city_data.index

Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object')

In [25]:
city_data.columns

Index(['revenue', 'employee_count'], dtype='object')

In [26]:
city_data.values

array([[4.2e+03, 5.0e+00],
       [6.5e+03, 8.0e+00],
       [8.0e+03,     nan]])

In [30]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [27]:
# axis
city_data.axes

[Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object'),
 Index(['revenue', 'employee_count'], dtype='object')]

In [28]:
city_data.axes[0]

Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object')

In [29]:
city_data.axes[1]

Index(['revenue', 'employee_count'], dtype='object')

In [31]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [33]:
city_data.keys()

Index(['revenue', 'employee_count'], dtype='object')

### Accessing Series Elements

* `.loc`

* `.iloc`

### Accessing DataFrame Elements

In [35]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [37]:
# Using Index operator
city_data['revenue']

Amsterdam    4200
Tokyo        6500
Toronto      8000
Name: revenue, dtype: int64

In [38]:
city_data.revenue

Amsterdam    4200
Tokyo        6500
Toronto      8000
Name: revenue, dtype: int64

`.loc`

`.iloc`

In [42]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [39]:
city_data.loc['Amsterdam']

revenue           4200.0
employee_count       5.0
Name: Amsterdam, dtype: float64

In [41]:
city_data.iloc[1]

revenue           6500.0
employee_count       8.0
Name: Tokyo, dtype: float64

#### Moreover

In [43]:
city_data.loc['Amsterdam':'Tokyo', 'revenue']

Amsterdam    4200
Tokyo        6500
Name: revenue, dtype: int64

In [44]:
city_data.loc[['Amsterdam','Toronto'], 'revenue']

Amsterdam    4200
Toronto      8000
Name: revenue, dtype: int64

In [46]:
city_data.loc[['Amsterdam','Toronto'], ['revenue', 'employee_count']]

           revenue  employee_count
Amsterdam     4200             5.0
Toronto       8000             NaN

### Combining Multiple DataFrame

In [47]:
further_city_data = pd.DataFrame(
    {"revenue": [7000, 3400], "employee_count": [2, 2]},
    index=["New York", "Barcelona"]
)

In [48]:
further_city_data

           revenue  employee_count
New York      7000               2
Barcelona     3400               2

In [49]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [52]:
all_city_data = pd.concat([city_data, further_city_data], sort=False)   #pake concate

In [51]:
all_city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN
New York      7000             2.0
Barcelona     3400             2.0

#### more

In [54]:
city_countries = pd.DataFrame({
    "country": ["Holland", "Japan", "Holland", "Canada", "Spain"],
    "capital": [1, 1, 0, 0, 0]},
    index=["Amsterdam", "Tokyo", "Rotterdam", "Toronto", "Barcelona"]
)

In [55]:
city_countries

           country  capital
Amsterdam  Holland        1
Tokyo        Japan        1
Rotterdam  Holland        0
Toronto     Canada        0
Barcelona    Spain        0

In [57]:
all_city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN
New York      7000             2.0
Barcelona     3400             2.0

In [59]:
cities = pd.concat([all_city_data, city_countries], axis=1, sort=False)
cities

           revenue  employee_count  country  capital
Amsterdam   4200.0             5.0  Holland      1.0
Tokyo       6500.0             8.0    Japan      1.0
Toronto     8000.0             NaN   Canada      0.0
New York    7000.0             2.0      NaN      NaN
Barcelona   3400.0             2.0    Spain      0.0
Rotterdam      NaN             NaN  Holland      0.0

In [60]:
pd.concat([all_city_data, city_countries], axis=1, join="inner")  # kinda like Intersection in Venn diagram

           revenue  employee_count  country  capital
Amsterdam     4200             5.0  Holland        1
Tokyo         6500             8.0    Japan        1
Toronto       8000             NaN   Canada        0
Barcelona     3400             2.0    Spain        0

## Merge

In [61]:
countries = pd.DataFrame({
    "population_millions": [17, 127, 37],
    "continent": ["Europe", "Asia", "North America"]
}, index=["Holland", "Japan", "Canada"])

countries

         population_millions      continent
Holland                   17         Europe
Japan                    127           Asia
Canada                    37  North America

In [62]:
cities

           revenue  employee_count  country  capital
Amsterdam   4200.0             5.0  Holland      1.0
Tokyo       6500.0             8.0    Japan      1.0
Toronto     8000.0             NaN   Canada      0.0
New York    7000.0             2.0      NaN      NaN
Barcelona   3400.0             2.0    Spain      0.0
Rotterdam      NaN             NaN  Holland      0.0

In [63]:
pd.merge(cities, countries, left_on="country", right_index=True)  # by default, How  = inner

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,4200.0,5.0,Holland,1.0,17,Europe
Rotterdam,NaN,NaN,Holland,0.0,17,Europe
Tokyo,6500.0,8.0,Japan,1.0,127,Asia
Toronto,8000.0,NaN,Canada,0.0,37,North America

In [65]:
pd.merge(cities, countries, left_on="country", right_index=True, how="left")  # use How parameter to include all cities

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,4200.0,5.0,Holland,1.0,17.0,Europe
Tokyo,6500.0,8.0,Japan,1.0,127.0,Asia
Toronto,8000.0,NaN,Canada,0.0,37.0,North America
New York,7000.0,2.0,NaN,NaN,NaN,NaN
Barcelona,3400.0,2.0,Spain,0.0,NaN,NaN
Rotterdam,NaN,NaN,Holland,0.0,17.0,Europe